[
    {
        "Date": "2021-03-12T22:17:29Z",
        "Title": "Why game developers can’t get a handle on doors",
        "Full_Article": "The best kind of door in a video game is the one no one remembers. Sure, everyone can appreciate a big, beautiful door with great animations, says Owlchemy Labs developer Pete Galbraith. But in a vid… [+5812 chars]",
        "Author": "Megan Farokhmanesh",
        "From": "The Verge"
    },
    {
        "Date": "2021-03-12T21:52:25Z",
        "Title": "Some Bethesda games now on Xbox Game Pass are getting frame rate boosts on Xbox Series X/S",
        "Full_Article": "Dishonored: Definitive Edition, Fallout games, and Prey boosted to 60 fps\r\nIllustration by Alex Castro / The Verge\r\nMicrosofts Xbox Game Pass platform just got a huge boost with the addition of 20 ne… [+1489 chars]",
        "Author": "Nick Statt",
        "From": "The Verge"
    },
    {
        "Date": "2021-03-12T21:18:30Z",
        "Title": "Bitwarden adds secure text and file transfer to its arsenal",
        "Full_Article": "A new Send feature lets you send links to encrypted files\r\nMany current password managers allow you to share your passwords with family members or other individuals or groups. (You do use a password … [+2396 chars]",
        "Author": "Barbara Krasnoff",
        "From": "The Verge"
    },
    {
        "Date": "2021-03-12T20:55:30Z",
        "Title": "Here’s where you can buy a PS5",
        "Full_Article": "Its quite difficult to buy one these days\r\nIf you buy something from a Verge link, Vox Media may earn a commission. See our ethics statement.\r\nUpdate March 12th, 2021 3:55PM ET: Best Buy currently ha… [+4935 chars]",
        "Author": "Taylor Lyles",
        "From": "The Verge"
    },
    {
        "Date": "2021-03-12T20:46:09Z",
        "Title": "Amazon Prime Video will soon let you shuffle all the shows you’ve been meaning to binge",
        "Full_Article": "Amazon seems to be trying to get the feature out before Netflix does\r\nIllustration by Alex Castro / The Verge\r\nAmazon is updating its Prime Video app to include a new feature: the ability to play epi… [+910 chars]",
        "Author": "Mitchell Clark",
        "From": "The Verge"
    },
    {
        "Date": "2021-03-12T20:42:11Z",
        "Title": "Sony’s PlayStation 5 is restocked at Best Buy",
        "Full_Article": "Both PS5s are in stock right now\r\nIf you buy something from a Verge link, Vox Media may earn a commission. See our ethics statement.\r\nIf you missed Targets PS5 restocks Thursday, you may be in luck. … [+1785 chars]",
        "Author": "Taylor Lyles",
        "From": "The Verge"
    },
    {
        "Date": "2021-03-12T19:32:17Z",
        "Title": "Microsoft’s Edge browser will match Chrome’s upcoming four-week release cycle",
        "Full_Article": "The change will go into effect in September\r\nIllustration by Alex Castro / The Verge\r\nMicrosoft is going to adjust its release cycles for Microsoft Edge to match the every-four-weeks release cadence … [+923 chars]",
        "Author": "Jay Peters",
        "From": "The Verge"
    },
    {
        "Date": "2021-03-12T19:06:03Z",
        "Title": "Pocket’s sort by time to read feature seems designed for the return of commutes",
        "Full_Article": "Image: Pocket\r\n\n \n\n Pocket, an app for saving articles to read later, is rolling out a sorting option to Android users over the next few weeks that could solve my paralysis when choosing something to… [+2076 chars]",
        "Author": "Ian Carlos Campbell",
        "From": "The Verge"
    },
    {
        "Date": "2021-03-12T18:29:00Z",
        "Title": "A secretive metaverse creator bought the $69 million Beeple NFT",
        "Full_Article": "The third-highest auction price for a living artist\r\nImage: Beeple\r\nMetaKovan, the pseudonymous founder of MetaPurse, is the buyer behind the $69 million winning bid for a Beeple NFT at Christies yes… [+2880 chars]",
        "Author": "Jacob Kastrenakes",
        "From": "The Verge"
    },
    {
        "Date": "2021-03-12T18:06:46Z",
        "Title": "Microsoft and newspapers join forces to fight Google",
        "Full_Article": "With the support of both Republicans and Democrats\r\nPhoto by Drew Angerer/Getty Images\r\nThis story is part of a group of stories called \r\nHill Report is a digest of the congressional hearings that im… [+5432 chars]",
        "Author": "Makena Kelly",
        "From": "The Verge"
    },
    {
        "Date": "2021-03-12T17:46:22Z",
        "Title": "GM-backed startup Lordstown Motors accused of faking preorders",
        "Full_Article": "The short-selling firm that dug into Nikola last year has a new target\r\nImage: Lordstown Motors\r\nGeneral Motors-backed EV startup Lordstown Motors has been accused of fabricating some of the 100,000 … [+5380 chars]",
        "Author": "Sean O'Kane",
        "From": "The Verge"
    },
    {
        "Date": "2021-03-12T17:32:01Z",
        "Title": "Let this robot Twitter composer serenade you with randomly generated music",
        "Full_Article": "Illustration by Alex Castro / The Verge\r\n\n \n\n I have been listening to robot-made music all week. No, not Daft Punk, but randomly generated music posted every hour by a Twitter bot, @MelodyBot3456. A… [+2197 chars]",
        "Author": "Jay Peters",
        "From": "The Verge"
    },
    {
        "Date": "2021-03-12T17:19:52Z",
        "Title": "MSI Summit B15 review: average business",
        "Full_Article": "MSI Summit B15 review: average business\r\nFunctional but could be better\r\nThe MSI Summit B15 is functional, with some caveats.\r\nThis year, multiple companies primarily known for gaming laptops have be… [+9150 chars]",
        "Author": "Monica Chin",
        "From": "The Verge"
    },
    {
        "Date": "2021-03-12T17:04:42Z",
        "Title": "Disney’s MagicMobile pass is a contactless alternative to the MagicBand",
        "Full_Article": "It will roll out first on Apple devices\r\nWho needs a plastic wristband when you can use your iPhone to do the same thing?\r\nImage: Disney\r\nIn 2013, Walt Disney World resort offered the MagicBands a pl… [+1146 chars]",
        "Author": "Taylor Lyles",
        "From": "The Verge"
    },
    {
        "Date": "2021-03-12T17:00:00Z",
        "Title": "Facebook’s next big AI project is training its machines on users’ public videos",
        "Full_Article": "AI that can understand video could be put to a variety of uses\r\nIllustration by Alex Castro / The Verge\r\nTeaching AI systems to understand whats happening in videos as completely as a human can is on… [+8111 chars]",
        "Author": "James Vincent",
        "From": "The Verge"
    },
    {
        "Date": "2021-03-12T16:36:24Z",
        "Title": "Tim Berners-Lee says internet access should be a basic right",
        "Full_Article": "Failing to provide universal access means losing opportunities to serve humanity, he says\r\nPhoto by Paul Clarke / Wikimedia\r\nTim Berners-Lee, the inventor of the world wide web, writes in a new post … [+3082 chars]",
        "Author": "Kim Lyons",
        "From": "The Verge"
    },
    {
        "Date": "2021-03-12T16:30:39Z",
        "Title": "Almost all of LG’s Android 11 updates aren’t coming until the end of 2021",
        "Full_Article": "At least, according to the companys German website\r\nPhoto by Chaim Gartenberg / The Verge\r\nLGs German website has revealed its Android 11 update roadmap at least for Europe and the news isnt too enco… [+1052 chars]",
        "Author": "Chaim Gartenberg",
        "From": "The Verge"
    },
    {
        "Date": "2021-03-12T16:23:04Z",
        "Title": "Vergecast: NFT mania, the Sonos Roam, and the next Android phones",
        "Full_Article": "Illustration by Alex Castro / The Verge\r\n\n \n\n Every Friday, The Verge publishes our flagship podcast The Vergecast, our chat show discussing the week in tech news featuring our reporters and editors.… [+2097 chars]",
        "Author": "Andrew Marino",
        "From": "The Verge"
    },
    {
        "Date": "2021-03-12T16:16:28Z",
        "Title": "Google slams Microsoft for trying ‘to break the way the open web works’",
        "Full_Article": "Google isnt happy with Microsoft over online news\r\nIllustration by Alex Castro / The Verge\r\nGoogle and Microsoft engineers might collaborate on the Chromium browser code, but that hasnt stopped corpo… [+3762 chars]",
        "Author": "Tom Warren",
        "From": "The Verge"
    },
    {
        "Date": "2021-03-12T16:15:00Z",
        "Title": "The engineers building ridiculous dart blasters that Nerf won’t touch",
        "Full_Article": "Luke Goodman, owner and founder of Out of Darts, is pictured in their Vancouver, WA factory and warehouse on February 25th, 2021.\r\n\n \n\n\n Inside the DIY Nerf arms race It was a beautiful summer day in… [+18309 chars]",
        "Author": "Sean Hollister",
        "From": "The Verge"
    },
    {
        "Date": "2021-03-12T15:38:06Z",
        "Title": "HBO Max will debut its cheaper, ad-supported tier in June",
        "Full_Article": "No price has been announced yet\r\nIf you buy something from a Verge link, Vox Media may earn a commission. See our ethics statement.\r\nWarnerMedia is set to launch an ad-supported tier for its HBO Max … [+2205 chars]",
        "Author": "Julia Alexander",
        "From": "The Verge"
    },
    {
        "Date": "2021-03-12T15:30:00Z",
        "Title": "How modders rebuilt Resident Evil 4’s graphics from scratch",
        "Full_Article": "An interview with the team behind the games visual overhaul\r\nA screenshot from the Resident Evil 4 HD Project.\r\nAlbert Marin has taken some very specific vacations. In Wales, he visited Raglan Castle… [+9637 chars]",
        "Author": "Cameron Faulkner",
        "From": "The Verge"
    },
    {
        "Date": "2021-03-12T15:04:51Z",
        "Title": "Samsung’s Galaxy Note 20 phones are up to $500 off today at Woot",
        "Full_Article": "Plus, grab a 14TB external USB 3.0 hard drive for only $220\r\nIf you buy something from a Verge link, Vox Media may earn a commission. See our ethics statement.\r\nThis story is part of a group of stori… [+3082 chars]",
        "Author": "Taylor Lyles",
        "From": "The Verge"
    },
    {
        "Date": "2021-03-12T15:00:00Z",
        "Title": "Stream it yourself",
        "Full_Article": "PmsProxy, a partnered Twitch streamer who has 147,000 followers, was tired. Tired of streaming Grand Theft Auto roleplay, and of streaming herself playing games more generally something shed been doi… [+9514 chars]",
        "Author": "Bijan Stephen",
        "From": "The Verge"
    },
    {
        "Date": "2021-03-12T14:31:34Z",
        "Title": "Sen. Marco Rubio endorses Amazon warehouse union drive in surprise op-ed",
        "Full_Article": "I stand with those at Amazons Bessemer warehouse today, Rubio writes\r\nPhoto by Michael Reynolds-Pool/Getty Images\r\nWriting in USA Today on Friday, Sen. Marco Rubio (R-FL) made a surprise endorsement … [+3601 chars]",
        "Author": "Russell Brandom",
        "From": "The Verge"
    },
    {
        "Date": "2021-03-12T14:00:00Z",
        "Title": "When games are hard on their hands, some players turn their voices into controllers",
        "Full_Article": "As both a software engineer and an avid player of strategy games, chaosparrot struggled to reckon with the damage his work and hobbies had done to his hands. By 2017, the consistent pain of his repet… [+6160 chars]",
        "Author": "Kait Sanchez",
        "From": "The Verge"
    },
    {
        "Date": "2021-03-12T13:58:00Z",
        "Title": "Trump’s Moon program survived a transfer of power, so what’s next?",
        "Full_Article": "With Artemis, Bidens NASA is focusing on continuity\r\nPresident Biden has been silent on his plans for NASA but excited about the agencys recent successes here, he virtually congratulates the team tha… [+8002 chars]",
        "Author": "Joey Roulette",
        "From": "The Verge"
    },
    {
        "Date": "2021-03-12T12:05:40Z",
        "Title": "These LED dice could electrify your next DnD campaign",
        "Full_Article": "The Pixels are available via Kickstarter, starting at $39\r\nThe dice are equipped with RGB lights and can communicate via Bluetooth.\r\nImage: Systemic Games / Kickstarter\r\nSometimes its nice to get awa… [+2783 chars]",
        "Author": "Jon Porter",
        "From": "The Verge"
    },
    {
        "Date": "2021-03-12T10:13:17Z",
        "Title": "Google says Chrome 89 keeps your Mac cooler, and saves ‘significant memory’ on Windows",
        "Full_Article": "Improvements have arrived on Windows, macOS, and Android\r\nIllustration by Alex Castro / The Verge\r\nGoogle has detailed the efficiency improvements it made with Chrome 89, the latest version of its br… [+1903 chars]",
        "Author": "Jon Porter",
        "From": "The Verge"
    },
    {
        "Date": "2021-03-12T07:30:26Z",
        "Title": "Almost a fifth of Facebook employees are now working on VR and AR: report",
        "Full_Article": "Nearly 10,000 employees in the Reality Labs division\r\nPhoto by Amelia Holowaty Krales / The Verge\r\nFacebook has nearly 10,000 employees in its division working on augmented reality and virtual realit… [+1328 chars]",
        "Author": "Sam Byford",
        "From": "The Verge"
    },
    {
        "Date": "2021-03-12T01:39:16Z",
        "Title": "Los Angeles movie-goers will soon be able to visit a theater for the first time in a year",
        "Full_Article": "LA county anticipates theaters will be able to re-open next week\r\nLos Angeles theaters will be allowed to reopen at 25 percent capacity next week, according to the LA Department of Public Health (via… [+1715 chars]",
        "Author": "Mitchell Clark",
        "From": "The Verge"
    },
    {
        "Date": "2021-03-12T01:23:21Z",
        "Title": "Biden: ‘all American adults will be eligible to get a vaccine no later than May 1st’",
        "Full_Article": "The federal government will also launch a vaccine-finding website by May 1st\r\nPresident Joe Biden just announced that he will direct states to make all adults eligible for COVID-19 vaccinations by Ma… [+2880 chars]",
        "Author": "Jay Peters",
        "From": "The Verge"
    },
    {
        "Date": "2021-03-11T23:44:15Z",
        "Title": "Facebook’s ‘culture fit’ is the focus of a discrimination complaint, report says",
        "Full_Article": "The company is currently being investigated by the Equal Employment Opportunity Commission\r\nIllustration by Alex Castro / The Verge\r\nA Black woman who interviewed at Facebook last year says she was t… [+2109 chars]",
        "Author": "Zoe Schiffer",
        "From": "The Verge"
    },
    {
        "Date": "2021-03-11T23:26:03Z",
        "Title": "Microsoft says the latest Xbox Series X update fixes controller disconnect issues",
        "Full_Article": "People have been reporting disconnect problems since the consoles launch\r\nPhoto by Tom Warren / The Verge\r\nMicrosoft released a new Xbox update earlier this week that brings toggles for Auto HDR and … [+1173 chars]",
        "Author": "Jay Peters",
        "From": "The Verge"
    },
    {
        "Date": "2021-03-11T23:10:22Z",
        "Title": "The latest Windows 10 update could cause your printer to crash your PC",
        "Full_Article": "Your PC ran into a problem and needs to restart\r\nPhoto by Monica Chin / The Verge\r\nThe latest Windows update has been causing problems for some printer owners, according to a report from Windows Late… [+2029 chars]",
        "Author": "Monica Chin",
        "From": "The Verge"
    },
    {
        "Date": "2021-03-11T22:51:18Z",
        "Title": "T-Mobile’s long-promised 5G home broadband will launch later this month",
        "Full_Article": "The program has been in a limited 4G pilot for the past two years\r\nT-Mobile hopes to expand the service to 7 to 8 million customers in the next five years\r\nIllustration by Alex Castro / The Verge\r\nAt… [+1141 chars]",
        "Author": "Allison Johnson",
        "From": "The Verge"
    },
    {
        "Date": "2021-03-11T22:50:08Z",
        "Title": "Go listen to Spotify’s podcast about itself that ignores the existence of iTunes",
        "Full_Article": "The podcast gets into the history of the company and has tons of technical details, but it revises history a bit\r\nPhoto by Michele Doying / The Verge\r\nSpotify is making a podcast about its own histor… [+1785 chars]",
        "Author": "Mitchell Clark",
        "From": "The Verge"
    },
    {
        "Date": "2021-03-11T22:35:15Z",
        "Title": "Pakistan is again banning TikTok, this time for ‘peddling vulgarity’",
        "Full_Article": "This is the second time the country has banned the short-form video app\r\nIllustration by Alex Castro / The Verge\r\nPakistan has banned TikTok yet again, citing objectionable content on the shortform v… [+2923 chars]",
        "Author": "Nick Statt",
        "From": "The Verge"
    },
    {
        "Date": "2021-03-11T22:10:33Z",
        "Title": "Gogo’s 5G network launch has stalled due to the chip shortage",
        "Full_Article": "The company is reportedly pushing its plans back a year to 2022\r\nGogo in-flight internet STOCK\r\nGogo will be delaying the rollout of its 5G network, pushing it back from 2021 to 2022. According to Li… [+1479 chars]",
        "Author": "Mitchell Clark",
        "From": "The Verge"
    },
    {
        "Date": "2021-03-11T21:55:31Z",
        "Title": "A Game Boy Advance might be the best way to watch Tenet, actually",
        "Full_Article": "Bob Wulff\r\n\n \n\n Tenet, the latest film by director Christopher Nolan, arrived on Blu-ray in December 2020, but now it has been released in another physical format: Game Boy Advance cartridges. Via En… [+586 chars]",
        "Author": "Cameron Faulkner",
        "From": "The Verge"
    },
    {
        "Date": "2021-03-11T21:49:18Z",
        "Title": "T-Mobile plans to turn up 5G speed this year, cover 90 percent of Americans with fast 5G by 2024",
        "Full_Article": "Increasing 5G speeds this year to an average of 400Mbps\r\nT-Mobile is keen to stay ahead of the 5G competition\r\nIllustration by Alex Castro / The Verge\r\nDuring its virtual analyst event today, T-Mobil… [+1543 chars]",
        "Author": "Allison Johnson",
        "From": "The Verge"
    },
    {
        "Date": "2021-03-11T21:36:01Z",
        "Title": "Go read this: the fight over YouTube creator Tim Pool’s news site — and a cat",
        "Full_Article": "Pool and partners were feuding over allegations of internet schemes\r\nImage: SCNR\r\nYouTube drama remains some of the most interesting drama, and a new report from The Daily Beast on infighting at poli… [+1241 chars]",
        "Author": "Ian Carlos Campbell",
        "From": "The Verge"
    },
    {
        "Date": "2021-03-11T20:47:53Z",
        "Title": "Apple sues 11-year veteran MacBook designer for allegedly stealing trade secrets for a journalist",
        "Full_Article": "The company claims that Simon Lancaster, a former product design architect, was selling trade secrets \r\nIllustration by Alex Castro / The Verge\r\nApple is suing Simon Lancaster, a former product desig… [+3117 chars]",
        "Author": "Chaim Gartenberg",
        "From": "The Verge"
    },
    {
        "Date": "2021-03-11T20:47:36Z",
        "Title": "Netflix is trying to crack down on password sharing with new test",
        "Full_Article": "Another way to tighten security measures, too\r\nIllustration by Alex Castro / The Verge\r\nNetflix has more than 200 million subscribers around the world, and now the company is looking at ways to curb … [+2643 chars]",
        "Author": "Julia Alexander",
        "From": "The Verge"
    },
    {
        "Date": "2021-03-11T20:03:24Z",
        "Title": "Xbox boss says Microsoft’s Bethesda deal was all about exclusive games for Game Pass",
        "Full_Article": "Microsofts $7.5 billion investment was all about Xbox Game Pass\r\nMicrosoft completed its $7.5 billion Bethesda acquisition earlier this week and initially hinted that some new titles in the future wo… [+3363 chars]",
        "Author": "Tom Warren",
        "From": "The Verge"
    },
    {
        "Date": "2021-03-11T19:17:00Z",
        "Title": "Uber and Lyft will share information about drivers deactivated for serious offenses",
        "Full_Article": "The companies will share information on drivers deactivated for assault and murder\r\nPhoto by ROBYN BECK/AFP via Getty Images\r\nUber and Lyft announced a first-of-its-kind effort to share information a… [+2165 chars]",
        "Author": "Andrew J. Hawkins",
        "From": "The Verge"
    },
    {
        "Date": "2021-03-11T19:08:59Z",
        "Title": "One year later",
        "Full_Article": "To brighter days ahead The calendar tells me that it’s been a year since the world changed. It’s been more than a year, really: the first COVID-19 case in the United States was reported on January 21… [+19834 chars]",
        "Author": "Nicole Wetsman",
        "From": "The Verge"
    },
    {
        "Date": "2021-03-11T18:54:46Z",
        "Title": "Spotify lets passengers fight over your road trip playlist, disturbing natural order of universe",
        "Full_Article": "Starting with the Android Automotive-powered Polestar 2\r\nPolestar / Beadyeye\r\nIts a fundamental rule of the road: driver picks the music. \r\nAnd yet, in a brazen challenge to the immutable laws of the… [+1723 chars]",
        "Author": "Chaim Gartenberg",
        "From": "The Verge"
    },
    {
        "Date": "2021-03-11T18:28:48Z",
        "Title": "Four years later, we are all BBC Dad",
        "Full_Article": "Four years ago yesterday, a meme was born: professor Robert Kelly, who will be forever known as BBC Dad, had the gall to get interrupted by his kids during a live video interview broadcast around the… [+1561 chars]",
        "Author": "Sean Hollister",
        "From": "The Verge"
    },
    {
        "Date": "2021-03-11T18:21:19Z",
        "Title": "20 Bethesda games will be available on Xbox Game Pass tomorrow",
        "Full_Article": "Xbox Game Pass gets a massive injection of games\r\nMicrosoft finalized its Bethesda acquisition earlier this week, and now the company is revealing which existing games will appear on Xbox Game Pass. … [+1308 chars]",
        "Author": "Tom Warren",
        "From": "The Verge"
    },
    {
        "Date": "2021-03-11T18:14:44Z",
        "Title": "The Hyundai Staria is the coolest-looking minivan in years",
        "Full_Article": "Another retro-futuristic vehicle from the Korean automaker \r\nImages: Hyundai\r\nMinivans are pretty much dead in the US, but Hyundais new Staria looks so slick that it makes me believe there could be a… [+1728 chars]",
        "Author": "Sean O'Kane",
        "From": "The Verge"
    },
    {
        "Date": "2021-03-11T17:04:33Z",
        "Title": "Bumble’s new Night In feature is an attempt to break the ice on virtual dates",
        "Full_Article": "Image: Bumble\r\n\n \n\n Dating app Bumble has announced Night In, a new feature that lets you play games on a virtual date. The feature is available to users in the US and Canada, and the game available … [+587 chars]",
        "Author": "Jon Porter",
        "From": "The Verge"
    },
    {
        "Date": "2021-03-11T17:00:00Z",
        "Title": "Google Maps will soon let you draw on a map to fix it",
        "Full_Article": "Missing road? You can plot it yourself.\r\nImage: Google\r\nIf youve ever been frustrated by a road simply not existing on Google Maps, the companys now making it easier than ever to add it. Google will … [+1576 chars]",
        "Author": "Mitchell Clark",
        "From": "The Verge"
    },
    {
        "Date": "2021-03-11T17:00:00Z",
        "Title": "GM aims to make its electric vehicles go farther and cost less with new battery partnership",
        "Full_Article": "SolidEnergy Systems is an MIT spinoff focused on improving energy density in batteries\r\nPhoto by Steve Fecht for General Motors\r\nGeneral Motors announced a new joint venture with SolidEnergy Systems,… [+4177 chars]",
        "Author": "Andrew J. Hawkins",
        "From": "The Verge"
    },
    {
        "Date": "2021-03-11T16:57:42Z",
        "Title": "Go read this story on how Facebook’s focus on growth stopped its AI team from fighting misinformation",
        "Full_Article": "The algorithms that maximize engagement reward inflammatory content\r\nIllustration by Alex Castro / Th\r\nFacebook has always been a company focused on growth above all else. More users and more engagem… [+4351 chars]",
        "Author": "James Vincent",
        "From": "The Verge"
    },
    {
        "Date": "2021-03-11T16:46:11Z",
        "Title": "Soon you’ll be able to buy a one-foot-tall figurine of ChilledCow’s lo-fi chill beats anime girl",
        "Full_Article": "Filed under:\r\nTime to study, time to die\r\nYoutooz\r\nJesus. Okay. Look, I like capitalism as much as the next schmuck who blogs for a living, but what is going on right now with regard to the efficient… [+1491 chars]",
        "Author": "Bijan Stephen",
        "From": "The Verge"
    },
    {
        "Date": "2021-03-11T16:35:52Z",
        "Title": "Taser maker Axon teams up with Skydio to sell drones directly to cops",
        "Full_Article": "Following the tarnishing of DJIs image for government drone work\r\nImage: Skydio\r\nAxon the law enforcement company that makes Tasers, police body cameras, and other police and military technologies ha… [+2808 chars]",
        "Author": "Chaim Gartenberg",
        "From": "The Verge"
    },
    {
        "Date": "2021-03-11T16:13:35Z",
        "Title": "Anker’s Liberty Air 2 Pro pair good noise cancellation with a low price",
        "Full_Article": "Ankers Liberty Air 2 Pro pair good noise cancellation with a low price\r\nAnd they have a surprisingly great app\r\nIf you buy something from a Verge link, Vox Media may earn a commission. See our ethics… [+8409 chars]",
        "Author": "Becca Farsace",
        "From": "The Verge"
    },
    {
        "Date": "2021-03-11T16:09:00Z",
        "Title": "These new 3D-printed homes in Austin are going for $450K",
        "Full_Article": "The printing process takes about a week\r\nOne of the new 3D-printed homes in the East 17th Street Residences in Austin, Texas.\r\nImage: ICON\r\nWhen it showed off its 3D-printed homes at the South by Sou… [+2260 chars]",
        "Author": "Kim Lyons",
        "From": "The Verge"
    },
    {
        "Date": "2021-03-11T16:00:00Z",
        "Title": "Grassroots online efforts are forming a new queer network of care",
        "Full_Article": "Almost exactly one year ago, Theo Hendrie thought he might have to drop out of school. His partner had lost his job, and they were struggling to pay bills and make ends meet. He worried that X Marks … [+5369 chars]",
        "Author": "Emma Banks",
        "From": "The Verge"
    },
    {
        "Date": "2021-03-11T15:37:13Z",
        "Title": "Lip-syncing app Wombo shows the messy, meme-laden potential of deepfakes",
        "Full_Article": "Stupid, silly, and lots of fun\r\nIts Wombo time. \r\nImage: Wombo\r\nYouve probably already seen a Wombo video floating around your social media. Maybe it was Ryu from Street Fighter singing the Witch Doc… [+4365 chars]",
        "Author": "James Vincent",
        "From": "The Verge"
    },
    {
        "Date": "2021-03-11T15:36:01Z",
        "Title": "Apple’s MagSafe Duo charger is down to its lowest price yet at Best Buy",
        "Full_Article": "Plus, Verge readers can grab an Apple Watch Sport Loop for $18 today\r\nIf you buy something from a Verge link, Vox Media may earn a commission. See our ethics statement.\r\nPhoto by Dieter Bohn / The Ve… [+2731 chars]",
        "Author": "Taylor Lyles",
        "From": "The Verge"
    },
    {
        "Date": "2021-03-11T15:32:36Z",
        "Title": "How Facebook could escape the FTC’s antitrust lawsuit",
        "Full_Article": "A new filing points at the shaky foundations of the governments case \r\nI.\r\nIn December, the Federal Trade Commission voted 3-2 to sue Facebook for illegally maintaining a monopoly in social networkin… [+6542 chars]",
        "Author": "Casey Newton",
        "From": "The Verge"
    },
    {
        "Date": "2021-03-11T15:23:17Z",
        "Title": "Go read this BuzzFeed News oral history of March 11th, 2020",
        "Full_Article": "Its the day the pandemic took over the United States\r\nIllustration by Alex Castro / The Verge\r\nEveryone had a different moment when the threat of the COVID-19 pandemic snapped into place. It may have… [+2308 chars]",
        "Author": "Nicole Wetsman",
        "From": "The Verge"
    },
    {
        "Date": "2021-03-11T15:09:08Z",
        "Title": "Beeple sold an NFT for $69 million",
        "Full_Article": "Beeple’s collage, Everydays: The First 5000 Days, sold at Christie’s. | Image: Beeple\r\n\n \n\n Until October, the most Mike Winkelmann — the digital artist known as Beeple — had ever sold a print for wa… [+5511 chars]",
        "Author": "Jacob Kastrenakes",
        "From": "The Verge"
    },
    {
        "Date": "2021-03-11T15:00:00Z",
        "Title": "The art of upcycling old sneakers into high-fashion corsets",
        "Full_Article": "Designer Cierra Boyd’s FRISKMEGOOD clothing line reworks upcycled sneakers into futuristic fashion. | Photos: FRISKMEGOOD\r\n\n \n\n Modern fashion is fraught with wasted product, so some designers are th… [+8985 chars]",
        "Author": "Kaitlin Hatton",
        "From": "The Verge"
    },
    {
        "Date": "2021-03-11T14:52:46Z",
        "Title": "How to create a signature for PDF documents on a PC",
        "Full_Article": "Adobe Acrobat Reader DC is your best free bet\r\nIf you buy something from a Verge link, Vox Media may earn a commission. See our ethics statement.\r\nPhoto by Tom Warren / The Verge\r\nEven before the COV… [+4347 chars]",
        "Author": "Barbara Krasnoff",
        "From": "The Verge"
    },
    {
        "Date": "2021-03-11T14:11:22Z",
        "Title": "Microsoft’s Xbox Series X / S consoles are in stock again at Target",
        "Full_Article": "While supplies last\r\nIf you buy something from a Verge link, Vox Media may earn a commission. See our ethics statement.\r\nPhoto by Tom Warren / The Verge\r\nMicrosofts Xbox Series X and Series S console… [+2504 chars]",
        "Author": "Taylor Lyles",
        "From": "The Verge"
    },
    {
        "Date": "2021-03-11T14:00:00Z",
        "Title": "Building the ultimate retro computer",
        "Full_Article": "Although I assembled it myself, and its software all comes from an open-source DIY project, in many ways my MiSTer is the most versatile computer I own. Its a shapeshifting wonderbox that can change … [+12097 chars]",
        "Author": "Sam Byford",
        "From": "The Verge"
    },
    {
        "Date": "2021-03-11T14:00:00Z",
        "Title": "Facebook is testing a way for creators to make money through Stories: sticker ads",
        "Full_Article": "Ads integrated into content\r\nIllustration by Alex Castro / The Verge\r\nFacebook introduced Stories to its platform four years ago, mostly as a way to encourage people to post content that wasnt highly… [+3276 chars]",
        "Author": "Ashley Carman",
        "From": "The Verge"
    },
    {
        "Date": "2021-03-11T13:00:00Z",
        "Title": "Dashlane is giving its one-click password changer a big upgrade",
        "Full_Article": "The new version is available in beta today\r\nImage: Dashlane\r\nPassword manager Dashlane is introducing a rebuilt version of its its one-click password changer in beta, the company announced today. Wit… [+4136 chars]",
        "Author": "Jay Peters",
        "From": "The Verge"
    },
    {
        "Date": "2021-03-11T12:59:36Z",
        "Title": "Sony’s PlayStation 5 is back in stock at Target again",
        "Full_Article": "Just the PS5 with a disc drive is up for purchase right now\r\nIf you buy something from a Verge link, Vox Media may earn a commission. See our ethics statement.\r\nPhoto by Vjeran Pavic / The Verge\r\nIf … [+2106 chars]",
        "Author": "Taylor Lyles",
        "From": "The Verge"
    },
    {
        "Date": "2021-03-11T12:37:37Z",
        "Title": "Amazon quietly opens its eleventh Fresh store, reportedly plans 28 more",
        "Full_Article": "Its first location only opened last August\r\nAmazons Fresh stores feature its high-tech Dash shopping carts.\r\nImage: Amazon\r\nLast Thursday, Amazon opened its 11th Amazon Fresh grocery store, Bloomberg… [+1177 chars]",
        "Author": "Jon Porter",
        "From": "The Verge"
    },
    {
        "Date": "2021-03-11T12:15:00Z",
        "Title": "Oppo announces Find X3 Pro flagship with microscope camera",
        "Full_Article": "And one... billion... colors\r\nAfter a drawn-out series of leaks and teases, Oppo has announced its 2021 flagship in full. The Find X3 Pro is a sleek, powerful phone with an unusual design and some un… [+3140 chars]",
        "Author": "Sam Byford",
        "From": "The Verge"
    },
    {
        "Date": "2021-03-11T11:23:40Z",
        "Title": "Chrome for Android can now preview a page before opening a link",
        "Full_Article": "Risky clicks no more\r\nPreview page now appears an an option when you long-press a link.\r\nScreenshot by Jon Porter / The Verge\r\nChromes Android app now lets you preview a webpage before committing to … [+1102 chars]",
        "Author": "Jon Porter",
        "From": "The Verge"
    },
    {
        "Date": "2021-03-11T11:05:35Z",
        "Title": "Microsoft’s Xbox TV era ends in May with the removal of OneGuide TV listings",
        "Full_Article": "The Xbox One started off as a cord-cutters dream\r\nThe original Xbox One with Kinect.\r\nMicrosoft is removing its TV listings feature on the Xbox One in May. Originally introduced as part of its broad … [+1589 chars]",
        "Author": "Tom Warren",
        "From": "The Verge"
    },
    {
        "Date": "2021-03-11T10:53:16Z",
        "Title": "Tens of thousands of Verkada cameras were easily accessible to employees as well as hackers",
        "Full_Article": "We literally had 20-year-old interns that had access to over 100,000 cameras\r\nEmployees of cloud-based surveillance firm Verkada had widespread access to feeds from customers cameras, according to ne… [+3656 chars]",
        "Author": "James Vincent",
        "From": "The Verge"
    },
    {
        "Date": "2021-03-11T09:52:28Z",
        "Title": "Relax with the calming sound of NASA’s Perseverance firing lasers on Mars",
        "Full_Article": "Filed under:\r\nAs it analyses surrounding rocks\r\nPerseverance touched down on Mars last month.\r\nPhoto: NASA/JPL\r\nNASA has released an audio recording of its Perseverance rover firing lasers on the mar… [+1833 chars]",
        "Author": "Jon Porter",
        "From": "The Verge"
    },
    {
        "Date": "2021-03-11T01:35:06Z",
        "Title": "Verizon decrees only ‘premium’ customers can escape its slowest 5G speeds",
        "Full_Article": "Verizon will reserve speed-boosting C-band frequencies for customers on more expensive plans\r\nVerizon wants to funnel more customers into its more expensive unlimited plans.\r\nIllustration by Alex Cas… [+2724 chars]",
        "Author": "Allison Johnson",
        "From": "The Verge"
    },
    {
        "Date": "2021-03-11T01:16:53Z",
        "Title": "Canoo reveals a bubbly electric pickup truck",
        "Full_Article": "Coming in 2023\r\nImages: Canoo\r\nNo, thats not a Duplo toy what you see above (and in the renders below) is the design for a pickup truck from California electric vehicle startup Canoo.\r\nRevealed in a … [+4057 chars]",
        "Author": "Sean O'Kane",
        "From": "The Verge"
    },
    {
        "Date": "2021-03-11T00:48:40Z",
        "Title": "GameStop’s stock was on the rise again, until it wasn’t",
        "Full_Article": "A wild Wednesday for GME\r\nGameStop stock (GME) soared in value on Wednesday, peaking at $348.50 per share. Then, in an event thats definitely not cause for concern, minutes later it lost fully half i… [+1101 chars]",
        "Author": "Ian Carlos Campbell",
        "From": "The Verge"
    }
]